tiborsimon/embedded-tdd-headers/pic/pic12/pic12f1571_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC12F1571_H_
#define _PIC12F1571_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define STATUS_DC                     6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define PIR1                          42
#define TMR1IF                        43
#define TMR2IF                        44
#define ADIF                          45
#define TMR1GIF                       46
#define PIR2                          47
#define C1IF                          48
#define PIR3                          49
#define PWM1IF                        50
#define PWM2IF                        51
#define PWM3IF                        52
#define TMR0                          53
#define TMR1L                         54
#define TMR1H                         55
#define T1CON                         56
#define TMR1ON                        57
#define nT1SYNC                       58
#define T1CKPS0                       59
#define T1CKPS                        60
#define T1CKPS1                       61
#define TMR1CS                        62
#define TMR1CS0                       63
#define TMR1CS1                       64
#define T1GCON                        65
#define T1GSS0                        66
#define T1GSS                         67
#define T1GSS1                        68
#define T1GVAL                        69
#define T1GGO_nDONE                   70
#define T1GGO                         71
#define T1GSPM                        72
#define T1GTM                         73
#define T1GPOL                        74
#define TMR1GE                        75
#define TMR2                          76
#define PR2                           77
#define T2CON                         78
#define T2CKPS0                       79
#define T2CKPS                        80
#define T2CKPS1                       81
#define TMR2ON                        82
#define T2OUTPS0                      83
#define T2OUTPS                       84
#define T2OUTPS1                      85
#define T2OUTPS2                      86
#define T2OUTPS3                      87
#define TRISA                         88
#define TRISA0                        89
#define TRISA1                        90
#define TRISA2                        91
#define TRISA3                        92
#define TRISA4                        93
#define TRISA5                        94
#define PIE1                          95
#define TMR1IE                        96
#define TMR2IE                        97
#define ADIE                          98
#define TMR1GIE                       99
#define PIE2                          100
#define C1IE                          101
#define PIE3                          102
#define PWM1IE                        103
#define PWM2IE                        104
#define PWM3IE                        105
#define OPTION_REG                    106
#define OPTION_REG_PS                 107
#define OPTION_REG_PS0                108
#define OPTION_REG_PS1                109
#define OPTION_REG_PS2                110
#define PSA                           111
#define T0SE                          112
#define TMR0SE                        113
#define T0CS                          114
#define TMR0CS                        115
#define INTEDG                        116
#define nWPUEN                        117
#define PCON                          118
#define nBOR                          119
#define nPOR                          120
#define nRI                           121
#define nRMCLR                        122
#define nRWDT                         123
#define STKUNF                        124
#define STKOVF                        125
#define WDTCON                        126
#define SWDTEN                        127
#define WDTPS                         128
#define WDTPS0                        129
#define WDTPS1                        130
#define WDTPS2                        131
#define WDTPS3                        132
#define WDTPS4                        133
#define OSCTUNE                       134
#define TUN0                          135
#define TUN                           136
#define TUN1                          137
#define TUN2                          138
#define TUN3                          139
#define TUN4                          140
#define TUN5                          141
#define OSCCON                        142
#define SCS0                          143
#define SCS                           144
#define SCS1                          145
#define IRCF                          146
#define IRCF0                         147
#define IRCF1                         148
#define IRCF2                         149
#define IRCF3                         150
#define SPLLEN                        151
#define OSCSTAT                       152
#define HFIOFS                        153
#define LFIOFR                        154
#define MFIOFR                        155
#define HFIOFL                        156
#define HFIOFR                        157
#define OSTS                          158
#define PLLR                          159
#define ADRESL                        160
#define ADRESH                        161
#define ADCON0                        162
#define ADON                          163
#define nDONE                         164
#define GO_nDONE                      165
#define GO                            166
#define ADGO                          167
#define CHS0                          168
#define CHS                           169
#define CHS1                          170
#define CHS2                          171
#define CHS3                          172
#define CHS4                          173
#define ADCON1                        174
#define ADPREF0                       175
#define ADPREF                        176
#define ADPREF1                       177
#define ADCS0                         178
#define ADCS                          179
#define ADCS1                         180
#define ADCS2                         181
#define ADFM                          182
#define ADCON2                        183
#define TRIGSEL0                      184
#define TRIGSEL                       185
#define TRIGSEL1                      186
#define TRIGSEL2                      187
#define TRIGSEL3                      188
#define LATA0                         189
#define LATA                          190
#define LATA1                         191
#define LATA2                         192
#define LATA4                         193
#define LATA5                         194
#define CM1CON0                       195
#define C1SYNC                        196
#define C1HYS                         197
#define C1SP                          198
#define C1POL                         199
#define C1OE                          200
#define C1OUT                         201
#define C1ON                          202
#define CM1CON1                       203
#define C1NCH0                        204
#define C1NCH                         205
#define C1NCH1                        206
#define C1NCH2                        207
#define C1PCH                         208
#define C1PCH0                        209
#define C1PCH1                        210
#define C1INTN                        211
#define C1INTP                        212
#define CMOUT                         213
#define MC1OUT                        214
#define BORCON                        215
#define BORRDY                        216
#define BORFS                         217
#define SBOREN                        218
#define FVRCON                        219
#define ADFVR0                        220
#define ADFVR                         221
#define ADFVR1                        222
#define CDAFVR0                       223
#define CDAFVR                        224
#define CDAFVR1                       225
#define TSRNG                         226
#define TSEN                          227
#define FVRRDY                        228
#define FVREN                         229
#define DACCON0                       230
#define DACPSS                        231
#define DACPSS0                       232
#define DACPSS1                       233
#define DACOE                         234
#define DACLPS                        235
#define DACEN                         236
#define DACCON1                       237
#define DACR0                         238
#define DACR                          239
#define DACR1                         240
#define DACR2                         241
#define DACR3                         242
#define DACR4                         243
#define APFCON                        244
#define P1SEL                         245
#define P2SEL                         246
#define T1GSEL                        247
#define CWGBSEL                       248
#define CWGASEL                       249
#define ANSA0                         250
#define ANSELA                        251
#define ANSA1                         252
#define ANSA2                         253
#define ANSA4                         254
#define PMADRL                        255
#define PMADRH                        256
#define PMDATL                        257
#define PMDATH                        258
#define PMCON1                        259
#define RD                            260
#define WR                            261
#define WREN                          262
#define WRERR                         263
#define FREE                          264
#define LWLO                          265
#define CFGS                          266
#define PMCON2                        267
#define VREGCON                       268
#define VREGPM                        269
#define WPUA0                         270
#define WPUA                          271
#define WPUA1                         272
#define WPUA2                         273
#define WPUA3                         274
#define WPUA4                         275
#define WPUA5                         276
#define ODCONA                        277
#define ODA                           278
#define ODA0                          279
#define ODA1                          280
#define ODA2                          281
#define ODA4                          282
#define ODA5                          283
#define SLRCONA                       284
#define SLRA                          285
#define SLRA0                         286
#define SLRA1                         287
#define SLRA2                         288
#define SLRA4                         289
#define SLRA5                         290
#define INLVLA                        291
#define INLVLA0                       292
#define INLVLA1                       293
#define INLVLA2                       294
#define INLVLA3                       295
#define INLVLA4                       296
#define INLVLA5                       297
#define IOCAP                         298
#define IOCAP0                        299
#define IOCAP1                        300
#define IOCAP2                        301
#define IOCAP3                        302
#define IOCAP4                        303
#define IOCAP5                        304
#define IOCAN0                        305
#define IOCAN                         306
#define IOCAN1                        307
#define IOCAN2                        308
#define IOCAN3                        309
#define IOCAN4                        310
#define IOCAN5                        311
#define IOCAF0                        312
#define IOCAF                         313
#define IOCAF1                        314
#define IOCAF2                        315
#define IOCAF3                        316
#define IOCAF4                        317
#define IOCAF5                        318
#define CWG1DBR0                      319
#define CWG1DBR                       320
#define CWG1DBR1                      321
#define CWG1DBR2                      322
#define CWG1DBR3                      323
#define CWG1DBR4                      324
#define CWG1DBR5                      325
#define CWG1DBF                       326
#define CWG1DBF0                      327
#define CWG1DBF1                      328
#define CWG1DBF2                      329
#define CWG1DBF3                      330
#define CWG1DBF4                      331
#define CWG1DBF5                      332
#define CWG1CON0                      333
#define G1CS0                         334
#define G1CS                          335
#define G1POLA                        336
#define G1POLB                        337
#define G1OEA                         338
#define G1OEB                         339
#define G1EN                          340
#define CWG1CON1                      341
#define G1IS0                         342
#define G1IS                          343
#define G1IS1                         344
#define G1IS2                         345
#define G1ASDLA                       346
#define G1ASDLA0                      347
#define G1ASDLA1                      348
#define G1ASDLB                       349
#define G1ASDLB0                      350
#define G1ASDLB1                      351
#define CWG1CON2                      352
#define G1ASDSFLT                     353
#define G1ASDSC1                      354
#define G1ARSEN                       355
#define G1ASE                         356
#define PWMEN                         357
#define MPWM1EN                       358
#define PWM1EN_A                      359
#define MPWM2EN                       360
#define PWM2EN_A                      361
#define MPWM3EN                       362
#define PWM3EN_A                      363
#define PWMLD                         364
#define MPWM1LD                       365
#define PWM1LDA_A                     366
#define MPWM2LD                       367
#define PWM2LDA_A                     368
#define PWM3LDA_A                     369
#define MPWM3LD                       370
#define PWMOUT                        371
#define PWM1OUT_A                     372
#define MPWM1OUT                      373
#define MPWM2OUT                      374
#define PWM2OUT_A                     375
#define MPWM3OUT                      376
#define PWM3OUT_A                     377
#define PWM1PHL                       378
#define PWM1PHL0                      379
#define PWM1PHL_PH                    380
#define PWM1PHL1                      381
#define PWM1PHL2                      382
#define PWM1PHL3                      383
#define PWM1PHL4                      384
#define PWM1PHL5                      385
#define PWM1PHL6                      386
#define PWM1PHL7                      387
#define PWM1PHH                       388
#define PWM1PHH0                      389
#define PWM1PHH_PH                    390
#define PWM1PHH1                      391
#define PWM1PHH2                      392
#define PWM1PHH3                      393
#define PWM1PHH4                      394
#define PWM1PHH5                      395
#define PWM1PHH6                      396
#define PWM1PHH7                      397
#define PWM1DCL_DC                    398
#define PWM1DCL                       399
#define PWM1DCL0                      400
#define PWM1DCL1                      401
#define PWM1DCL2                      402
#define PWM1DCL3                      403
#define PWM1DCL4                      404
#define PWM1DCL5                      405
#define PWM1DCL6                      406
#define PWM1DCL7                      407
#define PWM1DCH_DC                    408
#define PWM1DCH                       409
#define PWM1DCH0                      410
#define PWM1DCH1                      411
#define PWM1DCH2                      412
#define PWM1DCH3                      413
#define PWM1DCH4                      414
#define PWM1DCH5                      415
#define PWM1DCH6                      416
#define PWM1DCH7                      417
#define PWM1PRL                       418
#define PWM1PRL0                      419
#define PWM1PRL_PR                    420
#define PWM1PRL1                      421
#define PWM1PRL2                      422
#define PWM1PRL3                      423
#define PWM1PRL4                      424
#define PWM1PRL5                      425
#define PWM1PRL6                      426
#define PWM1PRL7                      427
#define PWM1PRH                       428
#define PWM1PRH_PR                    429
#define PWM1PRH0                      430
#define PWM1PRH1                      431
#define PWM1PRH2                      432
#define PWM1PRH3                      433
#define PWM1PRH4                      434
#define PWM1PRH5                      435
#define PWM1PRH6                      436
#define PWM1PRH7                      437
#define PWM1OFL0                      438
#define PWM1OFL_OF                    439
#define PWM1OFL                       440
#define PWM1OFL1                      441
#define PWM1OFL2                      442
#define PWM1OFL3                      443
#define PWM1OFL4                      444
#define PWM1OFL5                      445
#define PWM1OFL6                      446
#define PWM1OFL7                      447
#define PWM1OFH_OF                    448
#define PWM1OFH                       449
#define PWM1OFH0                      450
#define PWM1OFH1                      451
#define PWM1OFH2                      452
#define PWM1OFH3                      453
#define PWM1OFH4                      454
#define PWM1OFH5                      455
#define PWM1OFH6                      456
#define PWM1OFH7                      457
#define PWM1TMRL0                     458
#define PWM1TMRL_TMR                  459
#define PWM1TMRL                      460
#define PWM1TMRL1                     461
#define PWM1TMRL2                     462
#define PWM1TMRL3                     463
#define PWM1TMRL4                     464
#define PWM1TMRL5                     465
#define PWM1TMRL6                     466
#define PWM1TMRL7                     467
#define PWM1TMRH                      468
#define PWM1TMRH0                     469
#define PWM1TMRH_TMR                  470
#define PWM1TMRH1                     471
#define PWM1TMRH2                     472
#define PWM1TMRH3                     473
#define PWM1TMRH4                     474
#define PWM1TMRH5                     475
#define PWM1TMRH6                     476
#define PWM1TMRH7                     477
#define PWM1CON                       478
#define PWM1CON_MODE                  479
#define PWM1MODE0                     480
#define PWM1MODE                      481
#define PWM1CON_MODE0                 482
#define PWM1MODE1                     483
#define PWM1CON_MODE1                 484
#define PWM1CON_POL                   485
#define PWM1POL                       486
#define PWM1CON_OUT                   487
#define PWM1OUT                       488
#define PWM1OE                        489
#define PWM1CON_OE                    490
#define PWM1EN                        491
#define PWM1CON_EN                    492
#define PWM1INTE                      493
#define PWM1PRIE                      494
#define PWM1INTE_PRIE                 495
#define PWM1DCIE                      496
#define PWM1INTE_DCIE                 497
#define PWM1INTE_PHIE                 498
#define PWM1PHIE                      499
#define PWM1OFIE                      500
#define PWM1INTE_OFIE                 501
#define PWM1INTF                      502
#define PWM1INTF_PRIF                 503
#define PWM1PRIF                      504
#define PWM1INTF_DCIF                 505
#define PWM1DCIF                      506
#define PWM1PHIF                      507
#define PWM1INTF_PHIF                 508
#define PWM1OFIF                      509
#define PWM1INTF_OFIF                 510
#define PWM1CLKCON                    511
#define PWM1CLKCON_CS                 512
#define PWM1CS                        513
#define PWM1CLKCON_CS0                514
#define PWM1CS0                       515
#define PWM1CLKCON_CS1                516
#define PWM1CS1                       517
#define PWM1CLKCON_PS0                518
#define PWM1PS                        519
#define PWM1PS0                       520
#define PWM1CLKCON_PS                 521
