tiborsimon/embedded-tdd-headers/pic/pic12/pic12f1571_tdd.h
#define PWM1PS1                       522
#define PWM1CLKCON_PS1                523
#define PWM1PS2                       524
#define PWM1CLKCON_PS2                525
#define PWM1LDCON                     526
#define PWM1LDCON_LDS0                527
#define PWM1LDS                       528
#define PWM1LDCON_LDS                 529
#define PWM1LDS0                      530
#define PWM1LDCON_LDS1                531
#define PWM1LDS1                      532
#define PWM1LDCON_LDT                 533
#define PWM1LDM                       534
#define PWM1LD                        535
#define PWM1LDCON_LDA                 536
#define PWM1OFCON                     537
#define PWM1OFCON_OFS0                538
#define PWM1OFS                       539
#define PWM1OFCON_OFS                 540
#define PWM1OFS0                      541
#define PWM1OFCON_OFS1                542
#define PWM1OFS1                      543
#define PWM1OFMC                      544
#define PWM1OFCON_OFO                 545
#define PWM1OFM0                      546
#define PWM1OFM                       547
#define PWM1OFCON_OFM0                548
#define PWM1OFCON_OFM                 549
#define PWM1OFM1                      550
#define PWM1OFCON_OFM1                551
#define PWM2PHL_PH                    552
#define PWM2PHL0                      553
#define PWM2PHL                       554
#define PWM2PHL1                      555
#define PWM2PHL2                      556
#define PWM2PHL3                      557
#define PWM2PHL4                      558
#define PWM2PHL5                      559
#define PWM2PHL6                      560
#define PWM2PHL7                      561
#define PWM2PHH0                      562
#define PWM2PHH                       563
#define PWM2PHH_PH                    564
#define PWM2PHH1                      565
#define PWM2PHH2                      566
#define PWM2PHH3                      567
#define PWM2PHH4                      568
#define PWM2PHH5                      569
#define PWM2PHH6                      570
#define PWM2PHH7                      571
#define PWM2DCL_DC                    572
#define PWM2DCL0                      573
#define PWM2DCL                       574
#define PWM2DCL1                      575
#define PWM2DCL2                      576
#define PWM2DCL3                      577
#define PWM2DCL4                      578
#define PWM2DCL5                      579
#define PWM2DCL6                      580
#define PWM2DCL7                      581
#define PWM2DCH0                      582
#define PWM2DCH_DC                    583
#define PWM2DCH                       584
#define PWM2DCH1                      585
#define PWM2DCH2                      586
#define PWM2DCH3                      587
#define PWM2DCH4                      588
#define PWM2DCH5                      589
#define PWM2DCH6                      590
#define PWM2DCH7                      591
#define PWM2PRL0                      592
#define PWM2PRL_PR                    593
#define PWM2PRL                       594
#define PWM2PRL1                      595
#define PWM2PRL2                      596
#define PWM2PRL3                      597
#define PWM2PRL4                      598
#define PWM2PRL5                      599
#define PWM2PRL6                      600
#define PWM2PRL7                      601
#define PWM2PRH0                      602
#define PWM2PRH                       603
#define PWM2PRH_PR                    604
#define PWM2PRH1                      605
#define PWM2PRH2                      606
#define PWM2PRH3                      607
#define PWM2PRH4                      608
#define PWM2PRH5                      609
#define PWM2PRH6                      610
#define PWM2PRH7                      611
#define PWM2OFL                       612
#define PWM2OFL_OF                    613
#define PWM2OFL0                      614
#define PWM2OFL1                      615
#define PWM2OFL2                      616
#define PWM2OFL3                      617
#define PWM2OFL4                      618
#define PWM2OFL5                      619
#define PWM2OFL6                      620
#define PWM2OFL7                      621
#define PWM2OFH                       622
#define PWM2OFH0                      623
#define PWM2OFH_OF                    624
#define PWM2OFH1                      625
#define PWM2OFH2                      626
#define PWM2OFH3                      627
#define PWM2OFH4                      628
#define PWM2OFH5                      629
#define PWM2OFH6                      630
#define PWM2OFH7                      631
#define PWM2TMRL_TMR                  632
#define PWM2TMRL0                     633
#define PWM2TMRL                      634
#define PWM2TMRL1                     635
#define PWM2TMRL2                     636
#define PWM2TMRL3                     637
#define PWM2TMRL4                     638
#define PWM2TMRL5                     639
#define PWM2TMRL6                     640
#define PWM2TMRL7                     641
#define PWM2TMRH_TMR                  642
#define PWM2TMRH                      643
#define PWM2TMRH0                     644
#define PWM2TMRH1                     645
#define PWM2TMRH2                     646
#define PWM2TMRH3                     647
#define PWM2TMRH4                     648
#define PWM2TMRH5                     649
#define PWM2TMRH6                     650
#define PWM2TMRH7                     651
#define PWM2CON                       652
#define PWM2MODE0                     653
#define PWM2MODE                      654
#define PWM2CON_MODE0                 655
#define PWM2CON_MODE                  656
#define PWM2MODE1                     657
#define PWM2CON_MODE1                 658
#define PWM2POL                       659
#define PWM2CON_POL                   660
#define PWM2CON_OUT                   661
#define PWM2OUT                       662
#define PWM2OE                        663
#define PWM2CON_OE                    664
#define PWM2EN                        665
#define PWM2CON_EN                    666
#define PWM2INTE                      667
#define PWM2INTE_PRIE                 668
#define PWM2PRIE                      669
#define PWM2INTE_DCIE                 670
#define PWM2DCIE                      671
#define PWM2INTE_PHIE                 672
#define PWM2PHIE                      673
#define PWM2INTE_OFIE                 674
#define PWM2OFIE                      675
#define PWM2INTF                      676
#define PWM2INTF_PRIF                 677
#define PWM2PRIF                      678
#define PWM2INTF_DCIF                 679
#define PWM2DCIF                      680
#define PWM2INTF_PHIF                 681
#define PWM2PHIF                      682
#define PWM2INTF_OFIF                 683
#define PWM2OFIF                      684
#define PWM2CLKCON                    685
#define PWM2CS0                       686
#define PWM2CS                        687
#define PWM2CLKCON_CS0                688
#define PWM2CLKCON_CS                 689
#define PWM2CLKCON_CS1                690
#define PWM2CS1                       691
#define PWM2CLKCON_PS                 692
#define PWM2CLKCON_PS0                693
#define PWM2PS0                       694
#define PWM2PS                        695
#define PWM2PS1                       696
#define PWM2CLKCON_PS1                697
#define PWM2PS2                       698
#define PWM2CLKCON_PS2                699
#define PWM2LDCON                     700
#define PWM2LDCON_LDS0                701
#define PWM2LDS0                      702
#define PWM2LDCON_LDS                 703
#define PWM2LDS                       704
#define PWM2LDS1                      705
#define PWM2LDCON_LDS1                706
#define PWM2LDM                       707
#define PWM2LDCON_LDT                 708
#define PWM2LD                        709
#define PWM2LDCON_LDA                 710
#define PWM2OFCON                     711
#define PWM2OFS                       712
#define PWM2OFS0                      713
#define PWM2OFCON_OFS0                714
#define PWM2OFCON_OFS                 715
#define PWM2OFCON_OFS1                716
#define PWM2OFS1                      717
#define PWM2OFMC                      718
#define PWM2OFCON_OFO                 719
#define PWM2OFCON_OFM0                720
#define PWM2OFM                       721
#define PWM2OFCON_OFM                 722
#define PWM2OFM0                      723
#define PWM2OFCON_OFM1                724
#define PWM2OFM1                      725
#define PWM3PHL                       726
#define PWM3PHL_PH                    727
#define PWM3PHL0                      728
#define PWM3PHL1                      729
#define PWM3PHL2                      730
#define PWM3PHL3                      731
#define PWM3PHL4                      732
#define PWM3PHL5                      733
#define PWM3PHL6                      734
#define PWM3PHL7                      735
#define PWM3PHH0                      736
#define PWM3PHH                       737
#define PWM3PHH_PH                    738
#define PWM3PHH1                      739
#define PWM3PHH2                      740
#define PWM3PHH3                      741
#define PWM3PHH4                      742
#define PWM3PHH5                      743
#define PWM3PHH6                      744
#define PWM3PHH7                      745
#define PWM3DCL_DC                    746
#define PWM3DCL0                      747
#define PWM3DCL                       748
#define PWM3DCL1                      749
#define PWM3DCL2                      750
#define PWM3DCL3                      751
#define PWM3DCL4                      752
#define PWM3DCL5                      753
#define PWM3DCL6                      754
#define PWM3DCL7                      755
#define PWM3DCH_DC                    756
#define PWM3DCH0                      757
#define PWM3DCH                       758
#define PWM3DCH1                      759
#define PWM3DCH2                      760
#define PWM3DCH3                      761
#define PWM3DCH4                      762
#define PWM3DCH5                      763
#define PWM3DCH6                      764
#define PWM3DCH7                      765
#define PWM3PRL0                      766
#define PWM3PRL                       767
#define PWM3PRL_PR                    768
#define PWM3PRL1                      769
#define PWM3PRL2                      770
#define PWM3PRL3                      771
#define PWM3PRL4                      772
#define PWM3PRL5                      773
#define PWM3PRL6                      774
#define PWM3PRL7                      775
#define PWM3PRH0                      776
#define PWM3PRH_PR                    777
#define PWM3PRH                       778
#define PWM3PRH1                      779
#define PWM3PRH2                      780
#define PWM3PRH3                      781
#define PWM3PRH4                      782
#define PWM3PRH5                      783
#define PWM3PRH6                      784
#define PWM3PRH7                      785
#define PWM3OFL_OF                    786
#define PWM3OFL0                      787
#define PWM3OFL                       788
#define PWM3OFL1                      789
#define PWM3OFL2                      790
#define PWM3OFL3                      791
#define PWM3OFL4                      792
#define PWM3OFL5                      793
#define PWM3OFL6                      794
#define PWM3OFL7                      795
#define PWM3OFH_OF                    796
#define PWM3OFH0                      797
#define PWM3OFH                       798
#define PWM3OFH1                      799
#define PWM3OFH2                      800
#define PWM3OFH3                      801
#define PWM3OFH4                      802
#define PWM3OFH5                      803
#define PWM3OFH6                      804
#define PWM3OFH7                      805
#define PWM3TMRL0                     806
#define PWM3TMRL                      807
#define PWM3TMRL_TMR                  808
#define PWM3TMRL1                     809
#define PWM3TMRL2                     810
#define PWM3TMRL3                     811
#define PWM3TMRL4                     812
#define PWM3TMRL5                     813
#define PWM3TMRL6                     814
#define PWM3TMRL7                     815
#define PWM3TMRH0                     816
#define PWM3TMRH_TMR                  817
#define PWM3TMRH                      818
#define PWM3TMRH1                     819
#define PWM3TMRH2                     820
#define PWM3TMRH3                     821
#define PWM3TMRH4                     822
#define PWM3TMRH5                     823
#define PWM3TMRH6                     824
#define PWM3TMRH7                     825
#define PWM3CON                       826
#define PWM3CON_MODE0                 827
#define PWM3MODE                      828
#define PWM3CON_MODE                  829
#define PWM3MODE0                     830
#define PWM3CON_MODE1                 831
#define PWM3MODE1                     832
#define PWM3CON_POL                   833
#define PWM3POL                       834
#define PWM3CON_OUT                   835
#define PWM3OUT                       836
#define PWM3OE                        837
#define PWM3CON_OE                    838
#define PWM3EN                        839
#define PWM3CON_EN                    840
#define PWM3INTE                      841
#define PWM3PRIE                      842
#define PWM3INTE_PRIE                 843
#define PWM3INTE_DCIE                 844
#define PWM3DCIE                      845
#define PWM3PHIE                      846
#define PWM3INTE_PHIE                 847
#define PWM3INTE_OFIE                 848
#define PWM3OFIE                      849
#define PWM3INTF                      850
#define PWM3PRIF                      851
#define PWM3INTF_PRIF                 852
#define PWM3INTF_DCIF                 853
#define PWM3DCIF                      854
#define PWM3INTF_PHIF                 855
#define PWM3PHIF                      856
#define PWM3INTF_OFIF                 857
#define PWM3OFIF                      858
#define PWM3CLKCON                    859
#define PWM3CLKCON_CS                 860
#define PWM3CS                        861
#define PWM3CS0                       862
#define PWM3CLKCON_CS0                863
#define PWM3CS1                       864
#define PWM3CLKCON_CS1                865
#define PWM3PS0                       866
#define PWM3CLKCON_PS                 867
#define PWM3CLKCON_PS0                868
#define PWM3PS                        869
#define PWM3PS1                       870
#define PWM3CLKCON_PS1                871
#define PWM3PS2                       872
#define PWM3CLKCON_PS2                873
#define PWM3LDCON                     874
#define PWM3LDCON_LDS                 875
#define PWM3LDS0                      876
#define PWM3LDS                       877
#define PWM3LDCON_LDS0                878
#define PWM3LDS1                      879
#define PWM3LDCON_LDS1                880
#define PWM3LDCON_LDT                 881
#define PWM3LDM                       882
#define PWM3LDCON_LDA                 883
#define PWM3LD                        884
#define PWM3OFCON                     885
#define PWM3OFS                       886
#define PWM3OFCON_OFS0                887
#define PWM3OFS0                      888
#define PWM3OFCON_OFS                 889
#define PWM3OFCON_OFS1                890
#define PWM3OFS1                      891
#define PWM3OFMC                      892
#define PWM3OFCON_OFO                 893
#define PWM3OFM0                      894
#define PWM3OFCON_OFM0                895
#define PWM3OFCON_OFM                 896
#define PWM3OFM                       897
#define PWM3OFM1                      898
#define PWM3OFCON_OFM1                899
#define STATUS_SHAD                   900
#define C_SHAD                        901
#define DC_SHAD                       902
#define Z_SHAD                        903
#define WREG_SHAD                     904
#define BSR_SHAD                      905
#define PCLATH_SHAD                   906
#define FSR0L_SHAD                    907
#define FSR0H_SHAD                    908
#define FSR1L_SHAD                    909
#define FSR1H_SHAD                    910
#define STKPTR                        911
#define TOSL                          912
#define TOSH                          913

#endif // _PIC12F1571_H_
